function map = fun_defMap
%% 障碍物设置
% 每行代表一个障碍物，每个障碍物由多个顶点表示
% 边界障碍物
obs_boundary = {{[0,0; 1,0; 1,30; 0,30]}, ...
    {[0,30; 50,30; 50,31; 0,31]}, ...
    {[1,0; 51,0; 51,1; 1,1]}, ...
    {[50,1; 51,1; 51,31; 50,31]}
    };

% 多边形障碍物
obs_polygon = {{[14,12; 22,12; 22,14; 18,16; 14,14]}, ...
    {[18,22; 22,20; 26,22; 26,25; 18,25]}, ...
    {[26,7; 28,7; 30,13; 28,19; 26,19]}, ...
    {[32,14; 42,14; 42,16; 32,16]}
    };

% 圆形障碍物（x-y-r）
obs_circle = [7, 12, 3;
    46, 20, 2;
    15, 5, 2;
    37, 7, 3;
    37, 23, 3
    ];

% 定义地图结构体
map = struct;
map.obs_boundary = obs_boundary;
map.obs_polygon = obs_polygon;
map.obs_circle = obs_circle;
